       >>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. bankingtest.
AUTHOR. Lavender Persson.
DATE-WRITTEN. September 2nd 2026.
ENVIRONMENT DIVISION.

DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.

01 FullName    PIC X(50) VALUE ZERO.
01 DisplayName PIC X(50) VALUE ZERO.
01 SSN.
       02 SSArea   PIC 999.
       02 SSGroup  PIC 99.
       02 SSSerial PIC 9999.

PROCEDURE DIVISION.
DISPLAY "Enter full name. " WITH NO ADVANCING
ACCEPT FullName
DISPLAY "Enter " FUNCTION TRIM(FullName, TRAILING) "'s SSN. " WITH NO ADVANCING
ACCEPT SSN
DISPLAY FUNCTION TRIM(FullName, TRAILING) "'s SSN Serial is " SSSerial "."

STOP RUN.
